# Wine

### Introduction:

This exercise is a adaptation from the UCI Wine dataset.
The only pupose is to practice deleting data with pandas.

### Step 1. Import the necessary libraries

In [0]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data).

### Step 3. Assign it to a variable called wine

In [19]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data'
wine = pd.read_csv(url)

wine.head()

   1  14.23  1.71  2.43  15.6  127  ...   .28  2.29  5.64  1.04  3.92  1065
0  1  13.20  1.78  2.14  11.2  100  ...  0.26  1.28  4.38  1.05  3.40  1050
1  1  13.16  2.36  2.67  18.6  101  ...  0.30  2.81  5.68  1.03  3.17  1185
2  1  14.37  1.95  2.50  16.8  113  ...  0.24  2.18  7.80  0.86  3.45  1480
3  1  13.24  2.59  2.87  21.0  118  ...  0.39  1.82  4.32  1.04  2.93   735
4  1  14.20  1.76  2.45  15.2  112  ...  0.34  1.97  6.75  1.05  2.85  1450

[5 rows x 14 columns]

### Step 4. Delete the first, fourth, seventh, nineth, eleventh, thirteenth and fourteenth columns

In [20]:
wine = wine.drop(wine.columns[[0,3,6,8,11,12,13]], axis=1)
wine.head()

   14.23  1.71  15.6  127  3.06  2.29  5.64
0  13.20  1.78  11.2  100  2.76  1.28  4.38
1  13.16  2.36  18.6  101  3.24  2.81  5.68
2  14.37  1.95  16.8  113  3.49  2.18  7.80
3  13.24  2.59  21.0  118  2.69  1.82  4.32
4  14.20  1.76  15.2  112  3.39  1.97  6.75

### Step 5. Assign the columns as below:

The attributes are (donated by Riccardo Leardi, riclea '@' anchem.unige.it):  
1) alcohol  
2) malic_acid  
3) alcalinity_of_ash  
4) magnesium  
5) flavanoids  
6) proanthocyanins  
7) hue

In [0]:
wine.columns = ['alcohol', 'malic_acid', 'alcalinity_of_ash', 'magnesium', 'flavanoids', 'proanthocyanins', 'hue']

### Step 6. Set the values of the first 3 rows from alcohol as NaN

In [22]:
wine.iloc[:3,0] = np.nan
wine.head()

   alcohol  malic_acid  alcalinity_of_ash  ...  flavanoids  proanthocyanins   hue
0      NaN        1.78               11.2  ...        2.76             1.28  4.38
1      NaN        2.36               18.6  ...        3.24             2.81  5.68
2      NaN        1.95               16.8  ...        3.49             2.18  7.80
3    13.24        2.59               21.0  ...        2.69             1.82  4.32
4    14.20        1.76               15.2  ...        3.39             1.97  6.75

[5 rows x 7 columns]

### Step 7. Now set the value of the rows 3 and 4 of magnesium as NaN

In [0]:
wine.iloc[3:5, 3] = np.nan

### Step 8. Fill the value of NaN with the number 10 in alcohol and 100 in magnesium

In [26]:
wine['alcohol'].fillna('10', inplace=True)
wine['magnesium'].fillna('100', inplace=True)
wine.head()

  alcohol  malic_acid  alcalinity_of_ash  ... flavanoids  proanthocyanins   hue
0      10        1.78               11.2  ...       2.76             1.28  4.38
1      10        2.36               18.6  ...       3.24             2.81  5.68
2      10        1.95               16.8  ...       3.49             2.18  7.80
3   13.24        2.59               21.0  ...       2.69             1.82  4.32
4    14.2        1.76               15.2  ...       3.39             1.97  6.75

[5 rows x 7 columns]

### Step 9. Count the number of missing values

In [27]:
wine.isnull().sum()

alcohol              0
malic_acid           0
alcalinity_of_ash    0
magnesium            0
flavanoids           0
proanthocyanins      0
hue                  0
dtype: int64

### Step 10.  Create an array of 10 random numbers up until 10

In [34]:
random = np.random.randint(0, 10, 10)
random

array([3, 7, 8, 0, 2, 0, 6, 0, 3, 1])

### Step 11.  Use random numbers you generated as an index and assign NaN value to each of cell.

In [40]:
wine['alcohol'][random] = np.nan
wine.head(10)

/usr/local/lib/python2.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

  alcohol  malic_acid  alcalinity_of_ash  ... flavanoids  proanthocyanins   hue
0     NaN        1.78               11.2  ...       2.76             1.28  4.38
1     NaN        2.36               18.6  ...       3.24             2.81  5.68
2     NaN        1.95               16.8  ...       3.49             2.18  7.80
3     NaN        2.59               21.0  ...       2.69             1.82  4.32
4    14.2        1.76               15.2  ...       3.39             1.97  6.75
5   14.39        1.87               14.6  ...       2.52             1.98  5.25
6     NaN        2.15               17.6  ...       2.51             1.25  5.05
7     NaN        1.64               14.0  ...       2.98             1.98  5.20
8     NaN        1.35               16.0  ...       3.15             1.85  7.22
9    14.1        2.16               18.0  ...       3.32             2.38  5.75

[10 rows x 7 columns]

### Step 12.  How many missing values do we have?

In [41]:
wine.isnull().sum()

alcohol              7
malic_acid           0
alcalinity_of_ash    0
magnesium            0
flavanoids           0
proanthocyanins      0
hue                  0
dtype: int64

### Step 13. Delete the rows that contain missing values

In [42]:
wine.dropna(inplace=True, how='any')
wine.head(10)

   alcohol  malic_acid  alcalinity_of_ash  ... flavanoids  proanthocyanins   hue
4     14.2        1.76               15.2  ...       3.39             1.97  6.75
5    14.39        1.87               14.6  ...       2.52             1.98  5.25
9     14.1        2.16               18.0  ...       3.32             2.38  5.75
10   14.12        1.48               16.8  ...       2.43             1.57  5.00
11   13.75        1.73               16.0  ...       2.76             1.81  5.60
12   14.75        1.73               11.4  ...       3.69             2.81  5.40
13   14.38        1.87               12.0  ...       3.64             2.96  7.50
14   13.63        1.81               17.2  ...       2.91             1.46  7.30
15    14.3        1.92               20.0  ...       3.14             1.97  6.20
16   13.83        1.57               20.0  ...       3.40             1.72  6.60

[10 rows x 7 columns]

### Step 14. Print only the non-null values in alcohol

In [44]:
wine[wine['alcohol'].notnull()]['alcohol']

4       14.2
5      14.39
9       14.1
10     14.12
11     13.75
12     14.75
13     14.38
14     13.63
15      14.3
16     13.83
17     14.19
18     13.64
19     14.06
20     12.93
21     13.71
22     12.85
23      13.5
24     13.05
25     13.39
26      13.3
27     13.87
28     14.02
29     13.73
30     13.58
31     13.68
32     13.76
33     13.51
34     13.48
35     13.28
36     13.05
       ...
147    13.32
148    13.08
149     13.5
150    12.79
151    13.11
152    13.23
153    12.58
154    13.17
155    13.84
156    12.45
157    14.34
158    13.48
159    12.36
160    13.69
161    12.85
162    12.96
163    13.78
164    13.73
165    13.45
166    12.82
167    13.58
168     13.4
169     12.2
170    12.77
171    14.16
172    13.71
173     13.4
174    13.27
175    13.17
176    14.13
Name: alcohol, Length: 170, dtype: object

### Step 15.  Reset the index, so it starts with 0 again

In [0]:
wine.reset_index(drop=True, inplace=True)

### BONUS: Create your own question and answer it.

In [46]:
wine.head()

  alcohol  malic_acid  alcalinity_of_ash  ... flavanoids  proanthocyanins   hue
0    14.2        1.76               15.2  ...       3.39             1.97  6.75
1   14.39        1.87               14.6  ...       2.52             1.98  5.25
2    14.1        2.16               18.0  ...       3.32             2.38  5.75
3   14.12        1.48               16.8  ...       2.43             1.57  5.00
4   13.75        1.73               16.0  ...       2.76             1.81  5.60

[5 rows x 7 columns]